<img src='Titanic_Portside_Diagram.jpg' height="1000px" width="80%">

In [53]:
import pandas as pd 
import numpy as np

In [54]:
data = pd.read_csv("train.csv")

In [55]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

<div> 
survival - Survival (0 = No; 1 = Yes)<br>
class - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)<br>
sex - Sex<br>
age - Age<br>
sibsp - Number of Siblings/Spouses Aboard<br>
parch - Number of Parents/Children Aboard<br>
ticket - Ticket Number<br>
fare - Passenger Fare<br>
cabin - Cabin<br>
embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)<br>
boat - Lifeboat (if survived)<br>
body - Body number (if did not survive and body was recovered)<br>
</div>

#

In [56]:
data.shape

(891, 12)

In [57]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [58]:
data.drop(['SibSp', 'Parch', 'Name', 'Ticket', 'Cabin'], axis=1, inplace= True)

In [59]:
data.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [60]:
c = 0 
li = []
for u in data.Age.isna():
    if u == True :
        li.append(c)
    c+=1

In [61]:
g = data.groupby(['Pclass', 'Sex']).agg({'Age':'mean'})
g

                     Age
Pclass Sex
1      female  34.611765
       male    41.281386
2      female  28.722973
       male    30.740707
3      female  21.750000
       male    26.507589

In [62]:
ages = g.Age.tolist()

In [63]:
_class = [1, 2, 3]
sex = ['female', 'male']
for j in _class:
    for i in sex:
        data.Age[(data.Sex == i) & (data.Pclass == j)] = data.Age[(data.Sex == i) & (data.Pclass == j)].fillna(ages.pop(0))

C:\Users\10\AppData\Local\Temp/ipykernel_15940/2957573702.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.Age[(data.Sex == i) & (data.Pclass == j)] = data.Age[(data.Sex == i) & (data.Pclass == j)].fillna(ages.pop(0))

In [64]:
data.Age.isna().sum()

0

In [65]:
data.Fare.fillna(data.Fare.mean(), inplace= True)

In [66]:
data.head()

   PassengerId  Survived  Pclass     Sex   Age     Fare Embarked
0            1         0       3    male  22.0   7.2500        S
1            2         1       1  female  38.0  71.2833        C
2            3         1       3  female  26.0   7.9250        S
3            4         1       1  female  35.0  53.1000        S
4            5         0       3    male  35.0   8.0500        S

In [67]:
df = pd.get_dummies(data['Embarked'])
sexDf = pd.get_dummies(data['Sex'])

In [68]:
newData = pd.concat([data, sexDf, df], axis= 1)

In [69]:
newData.drop(['Sex', 'Embarked'], axis=1, inplace= True)

#

# make a column to specify if he was alone or not

# model

In [70]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import normalize

In [71]:
norData = normalize(newData[['Fare', 'Age']])

In [72]:
norData = pd.DataFrame(norData, columns=['fare', 'age'])

In [73]:
finalData = pd.concat([newData, norData], axis= 1)

In [74]:
finalData.drop(['Age', 'Fare'], axis=1, inplace= True)

In [75]:
finalData

     PassengerId  Survived  Pclass  female  male  C  Q  S      fare       age
0              1         0       3       0     1  0  0  1  0.312988  0.949757
1              2         1       1       1     0  1  0  0  0.882444  0.470417
2              3         1       3       1     0  0  0  1  0.291564  0.956551
3              4         1       1       1     0  0  0  1  0.834942  0.550338
4              5         0       3       0     1  0  0  1  0.224148  0.974555
..           ...       ...     ...     ...   ... .. .. ..       ...       ...
886          887         0       2       0     1  0  0  1  0.433816  0.901002
887          888         1       1       1     0  0  0  1  0.844819  0.535052
888          889         0       3       1     0  0  0  1  0.733183  0.680031
889          890         1       1       0     1  1  0  0  0.755689  0.654931
890          891         0       3       0     1  0  1  0  0.235383  0.971903

[891 rows x 10 columns]

In [76]:
X = finalData.drop('Survived', axis= 1)
y = finalData['Survived']

In [77]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=13)

#

In [78]:
from sklearn.linear_model import LogisticRegression

In [79]:
re = LogisticRegression()

In [80]:
re.fit(X_train, y_train)

LogisticRegression()

In [81]:
re.score(X_train, y_train)

0.7752808988764045

In [82]:
re.score(X_test, y_test)

0.8268156424581006